# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [24]:
import pandas as pd

In [25]:
url_1 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv'
url_2 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv'
url_3 = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv'
data_insurance1 = pd.read_csv(url_1)
data_insurance2 = pd.read_csv(url_2)
data_insurance3 = pd.read_csv(url_3)

In [26]:
data_insurance1.head(1)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934

In [27]:
data_insurance2.head(2)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
0,GS98873,Arizona,F,Bachelor,323912.47%,16061,88,1/0/00,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11%,79487,114,1/0/00,547.2,Special Auto,SUV

In [28]:
data_insurance3.head(2)

,Customer,State,Customer Lifetime Value,Education,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car

In [30]:
# I decided to define all the cleaning process of the first dataframe as functions and saved it as a main function in a py file 
# in the same folder of this file. To import the functions:
from clean_data_insurance import *

In [35]:
# Applying the function 'clean_data_insurance(df)' to the first dataframe:
data_insurance1 = clean_data_insurance(data_insurance1)
data_insurance1.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
1,QZ44356,Arizona,F,Bachelor,697953.59,0.0,94.0,,Personal Auto,Four-Door Car,1131.464935

In [51]:
# Checking how many rows and columns this dataframe has:
data_insurance1.shape

(1068, 11)

In [50]:
# Applying the function 'clean_data_insurance(df)' to the second dataframe:
data_insurance2 = clean_data_insurance(data_insurance2)
data_insurance2.head(1)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47,16061,88,,633.6,Personal Auto,Four-Door Car

In [46]:
# Checking how many rows and columns this dataframe has:
data_insurance2.shape

(992, 11)

In [47]:
# Applying the function 'clean_data_insurance(df)' to the third dataframe:
data_insurance3 = clean_data_insurance(data_insurance3)
data_insurance3.head(1)

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,,Personal Auto,499.2,Two-Door Car

In [48]:
# Checking how many rows and columns this dataframe has:
data_insurance3.shape

(7070, 11)

In [49]:
# Concatenating the three dataframes and checking the resulting dataframe's number of rows and columns
data_insurance_concat = pd.concat([data_insurance1, data_insurance2, data_insurance3], axis = 0)
data_insurance_concat.shape

(9130, 11)

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [53]:
url_mkt_analysis = 'https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv'

In [55]:
mkt_analysis_df = pd.read_csv(url_mkt_analysis)
mkt_analysis_df.head(2)

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1

In [60]:
# Start analyzing the dataframe:
mkt_analysis_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10910 entries, 0 to 10909
Data columns (total 27 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   unnamed:_0                     10910 non-null  int64
 1   customer                       10910 non-null  object
 2   state                          10910 non-null  object
 3   customer_lifetime_value        10910 non-null  float64
 4   response                       10910 non-null  object
 5   coverage                       10910 non-null  object
 6   education                      10910 non-null  object
 7   effective_to_date              10910 non-null  object
 8   employmentstatus               10910 non-null  object
 9   gender                         10910 non-null  object
 10  income                         10910 non-null  int64
 11  location_code                  10910 non-null  object
 12  marital_status                 10910 non-null  object
 13  monthly_premium_auto           10910 non-null  int64
 14  months_since_last_claim        10910 non-null  float64
 15  months_since_policy_inception  10910 non-null  int64
 16  number_of_open_complaints      10910 non-null  float64
 17  number_of_policies             10910 non-null  int64
 18  policy_type                    10910 non-null  object
 19  policy                         10910 non-null  object
 20  renew_offer_type               10910 non-null  object
 21  sales_channel                  10910 non-null  object
 22  total_claim_amount             10910 non-null  float64
 23  vehicle_class                  10910 non-null  object
 24  vehicle_size                   10910 non-null  object
 25  vehicle_type                   10910 non-null  object
 26  month                          10910 non-null  int64
dtypes: float64(4), int64(6), object(17)
memory usage: 2.2+ MB

In [61]:
mkt_analysis_df.dtypes

unnamed:_0                         int64
customer                          object
state                             object
customer_lifetime_value          float64
response                          object
coverage                          object
education                         object
effective_to_date                 object
employmentstatus                  object
gender                            object
income                             int64
location_code                     object
marital_status                    object
monthly_premium_auto               int64
months_since_last_claim          float64
months_since_policy_inception      int64
number_of_open_complaints        float64
number_of_policies                 int64
policy_type                       object
policy                            object
renew_offer_type                  object
sales_channel                     object
total_claim_amount               float64
vehicle_class                     object
vehicle_size                      object
vehicle_type                      object
month                              int64
dtype: object

In [ ]:
# The column 'unnamed:_0' seems to be a repeated index, so unnecessary. Dropping it:
mkt_analysis_df.drop(['unnamed:_0'], axis = 1, inplace=True)

In [65]:
mkt_analysis_df.head(1)

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,DK49336,Arizona,4809.21696,No,Basic,College,2011-02-18,Employed,M,48029,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.8,Four-Door Car,Medsize,A,2

In [69]:
# Verifying unique values of some columns to see if they're consistent:
mkt_analysis_df['state'].unique() # OK

array(['Arizona', 'California', 'Washington', 'Oregon', 'Nevada'],
      dtype=object)

In [68]:
mkt_analysis_df['response'].unique() # OK

array(['No', 'Yes'], dtype=object)

In [71]:
mkt_analysis_df['coverage'].unique() # OK

array(['Basic', 'Extended', 'Premium'], dtype=object)

In [73]:
mkt_analysis_df['education'].unique() # OK

array(['College', 'Bachelor', 'High School or Below', 'Doctor', 'Master'],
      dtype=object)

In [74]:
mkt_analysis_df['effective_to_date'].unique() # OK but not in the correct type of data

array(['2011-02-18', '2011-01-18', '2011-02-10', '2011-01-11',
       '2011-01-17', '2011-02-14', '2011-02-24', '2011-01-19',
       '2011-01-04', '2011-01-02', '2011-02-07', '2011-01-31',
       '2011-01-26', '2011-02-28', '2011-01-16', '2011-02-26',
       '2011-02-23', '2011-01-15', '2011-02-02', '2011-02-15',
       '2011-01-24', '2011-02-21', '2011-02-22', '2011-01-07',
       '2011-01-28', '2011-02-08', '2011-02-12', '2011-02-20',
       '2011-01-05', '2011-02-19', '2011-01-03', '2011-02-03',
       '2011-01-22', '2011-01-23', '2011-02-05', '2011-02-13',
       '2011-01-25', '2011-02-16', '2011-02-01', '2011-01-27',
       '2011-01-12', '2011-01-20', '2011-02-06', '2011-02-11',
       '2011-01-21', '2011-01-29', '2011-01-09', '2011-02-09',
       '2011-02-27', '2011-01-01', '2011-02-17', '2011-02-25',
       '2011-01-13', '2011-01-06', '2011-02-04', '2011-01-14',
       '2011-01-10', '2011-01-08', '2011-01-30'], dtype=object)

In [77]:
mkt_analysis_df['employmentstatus'].unique() # OK

array(['Employed', 'Unemployed', 'Medical Leave', 'Disabled', 'Retired'],
      dtype=object)

In [80]:
mkt_analysis_df['gender'].unique() # OK

array(['M', 'F'], dtype=object)

In [87]:
mkt_analysis_df['location_code'].unique() # OK

array(['Suburban', 'Urban', 'Rural'], dtype=object)

In [84]:
mkt_analysis_df['marital_status'].unique() # OK

array(['Married', 'Single', 'Divorced'], dtype=object)

In [86]:
mkt_analysis_df['number_of_open_complaints'].unique() # need to be casted as an integer

array([0.        , 0.38425611, 3.        , 1.        , 2.        ,
       4.        , 5.        ])

In [89]:
mkt_analysis_df['number_of_policies'].unique() # OK

array([9, 1, 2, 7, 4, 3, 6, 8, 5])

In [90]:
mkt_analysis_df['policy_type'].unique()

array(['Corporate Auto', 'Personal Auto', 'Special Auto'], dtype=object)

In [91]:
mkt_analysis_df['policy'].unique() # the information of this column is more complete than from the column 'policy_type'
# so we can maintain this one in the dataframe and drop the column 'policy_type'

array(['Corporate L3', 'Personal L3', 'Personal L2', 'Corporate L2',
       'Personal L1', 'Special L1', 'Corporate L1', 'Special L3',
       'Special L2'], dtype=object)

In [93]:
# Dropping 'policy_type' column:
mkt_analysis_df.drop(['policy_type'], axis = 1, inplace = True)

In [94]:
mkt_analysis_df['renew_offer_type'].unique() # OK

array(['Offer3', 'Offer4', 'Offer2', 'Offer1'], dtype=object)

In [96]:
mkt_analysis_df['sales_channel'].unique() # OK

array(['Agent', 'Call Center', 'Branch', 'Web'], dtype=object)

In [97]:
mkt_analysis_df['vehicle_class'].unique() 
# let's apply the cleaning function we developped for the second Lab to reduce the types of vehicle classes

array(['Four-Door Car', 'SUV', 'Two-Door Car', 'Sports Car', 'Luxury Car',
       'Luxury SUV'], dtype=object)

In [99]:
clean_vehicle(mkt_analysis_df)
mkt_analysis_df['vehicle_class'].unique()

array(['Four-Door Car', 'SUV', 'Two-Door Car', 'Luxury'], dtype=object)

In [101]:
mkt_analysis_df['vehicle_size'].unique() # OK

array(['Medsize', 'Small', 'Large'], dtype=object)

In [ ]:
mkt_analysis_df['vehicle_type'].unique()
# This column contains only one kind of value for all the rows of the dataframe (which probably means 'automobile').
# It doesn't provide an interesting information for the analysis, so it can be dropped.

In [105]:
mkt_analysis_df.drop(['vehicle_type'], axis = 1, inplace = True)

In [108]:
mkt_analysis_df['month'].unique() # OK

array([2, 1])

In [109]:
# Verifying null values:
mkt_analysis_df.isnull().sum()

customer                         0
state                            0
customer_lifetime_value          0
response                         0
coverage                         0
education                        0
effective_to_date                0
employmentstatus                 0
gender                           0
income                           0
location_code                    0
marital_status                   0
monthly_premium_auto             0
months_since_last_claim          0
months_since_policy_inception    0
number_of_open_complaints        0
number_of_policies               0
policy                           0
renew_offer_type                 0
sales_channel                    0
total_claim_amount               0
vehicle_class                    0
vehicle_size                     0
month                            0
dtype: int64

In [113]:
# Exercise 1

pivot_df = mkt_analysis_df.pivot_table(index='sales_channel', values=['customer_lifetime_value'], aggfunc="sum")
round(pivot_df, 2)

               customer_lifetime_value
sales_channel
Agent                      33057887.85
Branch                     24359201.21
Call Center                17364288.37
Web                        12697632.90

**Analyzing the resulting dataframe of the pivot method, it's possible to conclude:**
1. The sales channel that brought the highest revenue to the insurance company was the agents.
2. The sales channel that brought the lowest revenue to the insurance company was the web.
3. The success of the agents sales results might be due to a preference of the clients to deal
directly with a person, which leads more quickly to a relationship of proximity and trust that are
essential when selling a product like an insurance.
4. The low conversion of the web sales channel might be due to malfunctioning of the website or an
unfriendly user interface which difficults the understanding of the different types of policies by the client,
for example.
5. The call center could also be remodeled, since its sales correspond to half of the revenue provided by the agents.
A new and most efficient training of the employees regarding marketing and sales would be an interesting approach.
-----------------------------------------------------------------------------------------------

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [126]:
# Exercise 2:
pivot_df_2 = mkt_analysis_df.pivot_table(index='gender', columns ='education', values=['customer_lifetime_value'], aggfunc="mean")
round(pivot_df_2, 2)

          customer_lifetime_value                                         \
education                Bachelor  College   Doctor High School or Below
gender
F                         7874.27  7748.82  7328.51              8675.22
M                         7703.60  8052.46  7415.33              8149.69


education   Master
gender
F          8157.05
M          8168.83

**Analysing the dataframe created by the pivot method:**
1. Women are responsible for the highest customer lifetime value of the insurance company.
2. There isn't a correlation of the education level and the customer lifetime value, since for women, the lowest level of education (high school) is the one with the highest customer lifetime value; and the highest level of education corresponds to the lowest customer lifetime value.
3. For man, the results are similar to those for women, except for the highest customer lifetime value, which corresponds to customers with a Master's degree.

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [121]:
mkt_analysis_df.head(2)

,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,income,...,months_since_policy_inception,number_of_open_complaints,number_of_policies,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,month
0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,48029,...,52,0.0,9,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,2
1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,0,...,26,0.0,1,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,1

In [123]:
mkt_analysis_df['number_of_open_complaints'] = [int(number) for number in mkt_analysis_df['number_of_open_complaints']]

In [128]:
pivot_df_3 = mkt_analysis_df.pivot_table(index='policy', columns ='month', values=['number_of_open_complaints'], aggfunc="sum")
pivot_df_3

             number_of_open_complaints
month                                1    2
policy
Corporate L1                        70   76
Corporate L2                       115   90
Corporate L3                       230  195
Personal L1                        284  206
Personal L2                        556  446
Personal L3                        795  711
Special L1                          11   22
Special L2                          43   30
Special L3                          30   39